# pandas programs

In [1]:
import pandas as pd

In [8]:
# making a dataframe with two dimentional array

person_info=[['sowdhi',5.2,55],['sridevi',5.3,52],['sowjanya',5.4,55]]
pd.DataFrame(person_info,columns=['name','height','weight'])

       name  height  weight
0    sowdhi     5.2      55
1   sridevi     5.3      52
2  sowjanya     5.4      55

In [17]:
# making a Dataframe from dict of narray/list

fruits={'apple':[10,5],'banana':[5,6],'papaya':[50,2]}
pd.DataFrame(fruits,index=['cost','count'])

       apple  banana  papaya
cost      10       5      50
count      5       6       2

In [20]:
# making Dataframe from list of tuples

employe=[('sowdhi',15000),('sridevi',15000),('sowjanya',15000)]
pd.DataFrame(employe,columns=['name','salary'],index=[1194041,1194064,1226999])

             name  salary
1194041    sowdhi   15000
1194064   sridevi   15000
1226999  sowjanya   15000

In [24]:
# making Dataframe from list of dict

student=[{'name':'sowjanya','class':10,'grade':'A'},
        {'name':'sridevi','class':9,'grade':'B'}]
pd.DataFrame(student)

       name  class grade
0  sowjanya     10     A
1   sridevi      9     B

In [34]:
# list of nested dict

list=[
      {
        "student":[{"marks":90, "grade":"A"},
                   {"marks":95, "grade":"B"}
                  ],
      "name":"sridevi"
      },
      {
      "student":[{"marks":85, "grade":"B"},
                  {"marks":75, "grade":"C"}
                ],
      "name":"sowdhi"}
      ]
print(list)

[{'student': [{'marks': 90, 'grade': 'A'}, {'marks': 95, 'grade': 'B'}], 'name': 'sridevi'}, {'student': [{'marks': 85, 'grade': 'B'}, {'marks': 75, 'grade': 'C'}], 'name': 'sowdhi'}]

In [38]:
# replace values in dataframe using regex

fruits={'apple':[10,5],'banana':[5,6],'papaya':[50,2]}
pd.DataFrame(fruits,index=['cost','count'])

       apple  banana  papaya
cost      10       5      50
count      5       6       2

In [40]:
employe=(['sowdhi',15000],['sridevi',15000],['sowjanya',15000])
pd.DataFrame(employe,columns=['name','salary'],index=[1194041,1194064,1226999])

             name  salary
1194041    sowdhi   15000
1194064   sridevi   15000
1226999  sowjanya   15000

In [41]:
result=employe.replace(to_replace=15000,value=20000,regex=True)
print(result)

AttributeError: 'tuple' object has no attribute 'replace'

In [42]:
df = pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
  
# Let's create the index
index_ = [pd.Period('02-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
  
# Set the index
df.index = index_
  
# Let's print the dataframe
print(df)

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

In [43]:
result=df.replace(to_replace=2000,value=40000,regex=True)
print(result)

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy  40000
2018-12  new Orleans  Tech_Summit  12000

In [47]:
df=pd.DataFrame({'apple':[10,5],'banana':[5,6],'papaya':[50,2]})
index=['cost','count']
df.index=index
print(df)

       apple  banana  papaya
cost      10       5      50
count      5       6       2

In [49]:
result=df.replace(to_replace=5,value=100,regex=True)
print(result)

       apple  banana  papaya
cost      10     100      50
count    100       6       2

In [6]:
from io import StringIO
  
# wrap the string data in StringIO function
StringData = StringIO("""Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """)
  
# let's read the data using the Pandas
# read_csv() function
df = pd.read_csv(StringData,sep=';')
  
# Print the dataframe
print(df)

            Date    Event   Cost
0      10/2/2011    Music  10000
1      11/2/2011   Poetry  12000
2      12/2/2011  Theatre   5000
3      13/2/2011   Comedy   8000

In [2]:
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
 
df = pd.DataFrame(input_df)
print('Original DataFrame: \n', df)

Original DataFrame:
      name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

In [3]:
for index, row in df.iterrows():
    print(row['name'], row['age'])

Sujeet 10
Sameer 11
Sumit 12

In [4]:
data = {'Name': ['Ankit', 'Amit',
                 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce',
                   'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age', 
                                 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", df)
  
print("\nIterating over rows using index attribute :\n")
  
# iterate through each row and select
# 'Name' and 'Stream' column respectively.
for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [5]:
record = {
  
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }
  
# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", dataframe) 
  
# selecting rows based on condition
rslt_df = dataframe[dataframe['Percentage'] > 80]
  
print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [11]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
 
# Create an empty list
Row_list =[]
   
# Iterate over each row
for i in range((df.shape[0])):
   
    # Using iloc to access the values of 
    # the current row denoted by "i"
    Row_list.append(list(df.iloc[i, :]))
   
# Print the first 3 elements
print(Row_list[1:3])

[['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000]]

In [35]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
    
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
print(df)
print("------------------")
# select three rows and two columns 
print(df.loc[0:1, ['Name', 'Qualification']])

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
------------------
     Name Qualification
0     Jai           Msc
1  Princi            MA

In [56]:
import pandas as pd
import numpy as np
  
raw_Data = {'Voter_name': ['Geek1', 'Geek2', 'Geek3', 'Geek4', 
                           'Geek5', 'Geek6', 'Geek7', 'Geek8'], 
            'Voter_age': [15, 23, 25, 9, 67, 54, 42, np.NaN]}
  
df = pd.DataFrame(raw_Data, columns = ['Voter_name', 'Voter_age'])
print(df)
  
eligible = []
  
# For each row in the column
for age in df['Voter_age']:       
    if age >= 18:                   # if Voter eligible
        eligible.append('Yes')
    elif age < 18:                  # if voter is not eligible
        eligible.append("No")
    else:
        eligible.append("Not Sure")
  
# Create a column from the list
df['voter']=eligible
print(df)
df.rename(columns = {'voter_name':'TEST'}, inplace = True)
print(df.columns)

  Voter_name  Voter_age
0      Geek1       15.0
1      Geek2       23.0
2      Geek3       25.0
3      Geek4        9.0
4      Geek5       67.0
5      Geek6       54.0
6      Geek7       42.0
7      Geek8        NaN
  Voter_name  Voter_age     voter
0      Geek1       15.0        No
1      Geek2       23.0       Yes
2      Geek3       25.0       Yes
3      Geek4        9.0        No
4      Geek5       67.0       Yes
5      Geek6       54.0       Yes
6      Geek7       42.0       Yes
7      Geek8        NaN  Not Sure
Index(['Voter_name', 'Voter_age', 'voter'], dtype='object')

In [44]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
print(data)
   
# calling head() method 
# storing in new variable
data_top = data.tail()
   
# display
data_top

              Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [52]:
import pandas as pd
   
# making data frame
data = pd.read_csv("Test1.csv")
df=data.rename(columns={'column1':'num'},inplace=True)  
print(df)

None

In [59]:
import pandas as pd
import numpy as np
  
raw_Data = {'Voter_name': ['Geek1', 'Geek2', 'Geek3', 'Geek4', 
                           'Geek5', 'Geek6', 'Geek7', 'Geek8'], 
            'Voter_age': [15, 23, 25, 9, 67, 54, 42, np.NaN]}
  
df = pd.DataFrame(raw_Data, columns = ['Voter_name', 'Voter_age'])
print(df)
df.rename(columns = {'Voter_name':'TEST'}, inplace = True)
  
# After renaming the columns
print("\nAfter modifying first column:\n", df.columns)

  Voter_name  Voter_age
0      Geek1       15.0
1      Geek2       23.0
2      Geek3       25.0
3      Geek4        9.0
4      Geek5       67.0
5      Geek6       54.0
6      Geek7       42.0
7      Geek8        NaN

After modifying first column:
 Index(['TEST', 'Voter_age'], dtype='object')